---
kind: method
id: M:Autodesk.Revit.DB.OBJExportOptions.IsNormalToleranceSet
source: html/244c5a23-8f09-7ef4-c2ca-0aca09c1c614.htm
---
# Autodesk.Revit.DB.OBJExportOptions.IsNormalToleranceSet Method

Checks whether the NormalTolerance tessellation parameter is explicitly set.

## Syntax (C#)
```csharp
public bool IsNormalToleranceSet()
```

## Returns
True if NormalTolerance tessellation parameter is explicitly set, false otherwise.